export function WelcomePage() {
  return (
    <>
      <h1>Стартовая страница приветствия</h1>

      <p> Приветствие - Посвящение в задумку - 
        - Непрямая регистрация в виде прохождения теста\заполнения своей истории</p>

      <p>
        {" "}
        С давних пор мои предки были в авангарде борьбы России за своё место в
        мире. Как лист, влекомый ветром к новым обстоятельствам и свершениям,
        через неизвестность и испытания, они попадали с одного приграничья на
        другое. Несмотря на все, выпавшие на их долю испытания, они неизменно с
        честью исполняли свой долг, свою волю и своё предназначение. Из
        покаления в покаление укрепляя силу семьи и прилагая все усилия к её
        процветанию, совершенствованию и постепенному качественному улучшению.
      </p>
      <p>
        {" "}
        Род рос, усиливался и изменялся. Что-то терялось безвозвратно, но на
        смену старому приходило новое. Старшие оберегали молодых, повидавшие
        пытались научить неопытных, а вошедшие в силу заботились о немощных.
        Изменялись характеры, привычки и призвания, но неумолимое стремление к
        развитию оставалось неизменным маркером и путеводной звездой к заветному
        яркому будующему.
      </p>
      <p>
        {" "}
        Так продолжалось многие покаления, сотни лет подряд, пока не пришло
        время последней схватки старого мира. Мир окончательно замкнулся.
        Великие империи заняли всё доступное им пространство. Больше расширяться
        было некуда и на кону встало само их существование. Стало ясно, что в
        конечном итоге останется только один. С начала первой битвы огромной
        партии за выживание, прогрес значительно ускорился, так же стремительно,
        как и время, отпущенное человечеству на то, чтобы выбраться из
        всепоглащающей воронки всеобщего уничтожения. Банка со скорпеонами стала
        стремительно разогреваться, и дело времени, когда она лопнет и
        взорвётся, похоронив всех под своими обломками.
      </p>
      <p>
        {" "}
        В один из решающих моментов, когда от результатов схватки зависело
        существование всего населения нашей цивилизации, все мои предки мужского
        пола отдали жизни воимя священой победы и ради будующего их детей. Так
        моя семья лишилась примера отцов, получив взамен память о них и
        почетание. Гибель мужчин сильно ударила по роду. Горем, печалью и
        тяжестью превозмогания одиночества. Лишенные примера отцов, новые
        покаления были менее связаны родственными узами, а печать утраты,
        переданная матерями, изменила внутреннюю суть. Несмотря на это, мои
        предки неутомимо шли вперёд. Учились и учили, строили дома и воспитывали
        детей. Радовались жизни и работали над совой.
      </p>
      <p>
        {" "}
        С крушением союзного государства исчезла опора и фундамент с которой все
        мы связывали своё будующее. Наступили годы безвременья. Осколок некогда
        великой цивилизации, на котором мы оказались, стремительно скатывался в
        пропасть и мрак разрухи, вседозволенности и безнадёги.
      </p>
      <p>
        {" "}
        В это непростое время полнейшей обречённости и неопределённости, когда
        от былого рода остались лишь отдельные семьи, плохо помнящие своё
        родство, мои родители приняли решение бежать в последний оплод старой
        империи и самый большой осколок Союза - Россию. Так закончилась история
        многих поколений фронтира и колонизаторов новых земель, и началась наша
        история. История возрождения и очередного изменения семьи в центре
        возрождающейся и претерпевающей порой мучительные, но необходимые
        метоморфозы, Цивилизации.
      </p>
      <p>
        {" "}
        Для того, чтобы пройти эту жизнь с честью, мне придётся понять, принять
        и закрепить на уровне привычки тот факт, что определяющим мерилом успеха
        в данной жизни - является количество и регулярность сил, направленных на
        его достижение. Несмотря на неудачи, невзгоды и препятствия. То, что
        тебе трудн и ты не сдаёшься и приближает тебя к счастью! Готовься и не
        сдавайся!
      </p>
    </>
  );
}
